[
  {
    "title": "Morning Dua for Protection",
    "bangla": "Bismillahillazi la yadurru ma'asmihi shay'un fil-ardi wa la fis-sama'i wa huwas-sami'ul 'alim.",
    "arabic": "بِسْمِ اللَّهِ الَّذِي لَا يَضُرُّ مَعَ اسْمِهِ شَيْءٌ فِي الْأَرْضِ وَلَا فِي السَّمَاءِ وَهُوَ السَّمِيعُ الْعَلِيمُ",
    "transliteration": "Bismillahillazi la yadurru ma'asmihi shay'un fil-ardi wa la fis-sama'i wa huwas-sami'ul 'alim.",
    "meaning": "In the name of Allah, with whose name nothing can harm on earth or in heaven, and He is the All-Hearing, the All-Knowing.",
    "reference": "Abu Dawood 4/329"
  },
  {
    "title": "Evening Dua for Protection",
    "bangla": "A'udhu bi kalimatillahit-tammati min sharri ma khalaq.",
    "arabic": "أَعُوذُ بِكَلِمَاتِ اللَّهِ التَّامَّاتِ مِنْ شَرِّ مَا خَلَقَ",
    "transliteration": "A'udhu bi kalimatillahit-tammati min sharri ma khalaq.",
    "meaning": "I seek refuge in the perfect words of Allah from the evil of what He has created.",
    "reference": "Muslim 4/2089"
  },
  {
    "title": "Morning Dua for Blessings",
    "bangla": "Allahumma bika asbahna, wa bika amsayna, wa bika nahya, wa bika namutu, wa ilaykan-nushur.",
    "arabic": "اللَّهُمَّ بِكَ أَصْبَحْنَا، وَبِكَ أَمْسَيْنَا، وَبِكَ نَحْيَا، وَبِكَ نَمُوتُ، وَإِلَيْكَ النُّشُورُ",
    "transliteration": "Allahumma bika asbahna, wa bika amsayna, wa bika nahya, wa bika namutu, wa ilaykan-nushur.",
    "meaning": "O Allah, by You we enter the morning, and by You we enter the evening, and by You we live, and by You we die, and to You is the resurrection.",
    "reference": "Tirmidhi 5/466"
  },
  {
    "title": "Evening Dua for Blessings",
    "bangla": "Allahumma bika amsayna, wa bika asbahna, wa bika nahya, wa bika namutu, wa ilaykal-maseer.",
    "arabic": "اللَّهُمَّ بِكَ أَمْسَيْنَا، وَبِكَ أَصْبَحْنَا، وَبِكَ نَحْيَا، وَبِكَ نَمُوتُ، وَإِلَيْكَ الْمَصِيرُ",
    "transliteration": "Allahumma bika amsayna, wa bika asbahna, wa bika nahya, wa bika namutu, wa ilaykal-maseer.",
    "meaning": "O Allah, by You we enter the evening, and by You we enter the morning, and by You we live, and by You we die, and to You is the final return.",
    "reference": "Tirmidhi 5/466"
  },
  {
    "title": "Morning Dua for Health",
    "bangla": "Allahumma 'afini fi badani, Allahumma 'afini fi sam'i, Allahumma 'afini fi basari, la ilaha illa anta.",
    "arabic": "اللَّهُمَّ عَافِنِي فِي بَدَنِي، اللَّهُمَّ عَافِنِي فِي سَمْعِي، اللَّهُمَّ عَافِنِي فِي بَصَرِي، لَا إِلَهَ إِلَّا أَنْتَ",
    "transliteration": "Allahumma 'afini fi badani, Allahumma 'afini fi sam'i, Allahumma 'afini fi basari, la ilaha illa anta.",
    "meaning": "O Allah, grant health to my body. O Allah, grant health to my hearing. O Allah, grant health to my eyesight. There is no god but You.",
    "reference": "Abu Dawood 4/324"
  },
  {
    "title": "Evening Dua for Forgiveness",
    "bangla": "Allahumma inni asbahtu ushiduka wa ushidu hamalata 'arshika, wa mala'ikataka, wa jami'a khalqika, annaka antallahu la ilaha illa anta, wahdaka la sharika laka, wa anna Muhammadan 'abduka wa rasuluka.",
    "arabic": "اللَّهُمَّ إِنِّي أَمْسَيْتُ أُشْهِدُكَ وَأُشْهِدُ حَمَلَةَ عَرْشِكَ، وَمَلَائِكَتَكَ، وَجَمِيعَ خَلْقِكَ، أَنَّكَ أَنْتَ اللَّهُ لَا إِلَهَ إِلَّا أَنْتَ، وَحْدَكَ لَا شَرِيكَ لَكَ، وَأَنَّ مُحَمَّدًا عَبْدُكَ وَرَسُولُكَ",
    "transliteration": "Allahumma inni asbahtu ushiduka wa ushidu hamalata 'arshika, wa mala'ikataka, wa jami'a khalqika, annaka antallahu la ilaha illa anta, wahdaka la sharika laka, wa anna Muhammadan 'abduka wa rasuluka.",
    "meaning": "O Allah, I have entered the evening bearing witness to You, and to the bearers of Your Throne, and to Your angels, and to all Your creation, that You are Allah, there is no god but You alone, with no partner, and that Muhammad is Your slave and Messenger.",
    "reference": "Abu Dawood 4/318"
  },
  {
    "title": "Morning Dua for Faith Protection",
    "bangla": "Allahumma inni asbahtu ushiduka wa ushidu hamalata 'arshika, wa mala'ikataka, wa jami'a khalqika, annaka antallahu la ilaha illa anta, wahdaka la sharika laka, wa anna Muhammadan 'abduka wa rasuluka.",
    "arabic": "اللَّهُمَّ إِنِّي أَصْبَحْتُ أُشْهِدُكَ وَأُشْهِدُ حَمَلَةَ عَرْشِكَ، وَمَلَائِكَتَكَ، وَجَمِيعَ خَلْقِكَ، أَنَّكَ أَنْتَ اللَّهُ لَا إِلَهَ إِلَّا أَنْتَ، وَحْدَكَ لَا شَرِيكَ لَكَ، وَأَنَّ مُحَمَّدًا عَبْدُكَ وَرَسُولُكَ",
    "transliteration": "Allahumma inni asbahtu ushiduka wa ushidu hamalata 'arshika, wa mala'ikataka, wa jami'a khalqika, annaka antallahu la ilaha illa anta, wahdaka la sharika laka, wa anna Muhammadan 'abduka wa rasuluka.",
    "meaning": "O Allah, I have entered the morning bearing witness to You, and to the bearers of Your Throne, and to Your angels, and to all Your creation, that You are Allah, there is no god but You alone, with no partner, and that Muhammad is Your slave and Messenger.",
    "reference": "Abu Dawood 4/318"
  },
  {
    "title": "Evening Dua for Safety",
    "bangla": "Allahumma 'alimal-ghaybi wash-shahadati fatiras-samawati wal-ardi, rabba kulli shay'in wa malikahu, ashhadu an la ilaha illa anta, a'udhu bika min sharri nafsi wa min sharrish-shaytani wa shirkihi.",
    "arabic": "اللَّهُمَّ عَالِمَ الْغَيْبِ وَالشَّهَادَةِ فَاطِرَ السَّمَاوَاتِ وَالْأَرْضِ، رَبَّ كُلِّ شَيْءٍ وَمَلِيكَهُ، أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا أَنْتَ، أَعُوذُ بِكَ مِنْ شَرِّ نَفْسِي وَمِنْ شَرِّ الشَّيْطَانِ وَشِرْكِهِ",
    "transliteration": "Allahumma 'alimal-ghaybi wash-shahadati fatiras-samawati wal-ardi, rabba kulli shay'in wa malikahu, ashhadu an la ilaha illa anta, a'udhu bika min sharri nafsi wa min sharrish-shaytani wa shirkihi.",
    "meaning": "O Allah, Knower of the unseen and the seen, Creator of the heavens and the earth, Lord and Sovereign of all things, I bear witness that there is no god but You. I seek refuge in You from the evil of my soul and from the evil of Satan and his shirk.",
    "reference": "Tirmidhi 5/465"
  },
  {
    "title": "Morning Dua for Provision",
    "bangla": "Allahumma inni as'aluka 'ilman nafi'an, wa rizqan tayyiban, wa 'amalan mutaqabbalan.",
    "arabic": "اللَّهُمَّ إِنِّي أَسْأَلُكَ عِلْمًا نَافِعًا، وَرِزْقًا طَيِّبًا، وَعَمَلًا مُتَقَبَّلًا",
    "transliteration": "Allahumma inni as'aluka 'ilman nafi'an, wa rizqan tayyiban, wa 'amalan mutaqabbalan.",
    "meaning": "O Allah, I ask You for beneficial knowledge, good provision, and acceptable deeds.",
    "reference": "Ibn Majah 2/1254"
  },
  {
    "title": "Evening Dua for Peaceful Sleep",
    "bangla": "Bismika rabbi wada'tu janbi, wa bika arfa'uhu, in amsakta nafsi farhamha, wa in arsaltaha fahfazha bima tahfazu bihi 'ibadakas-salihin.",
    "arabic": "بِاسْمِكَ رَبِّي وَضَعْتُ جَنْبِي، وَبِكَ أَرْفَعُهُ، إِنْ أَمْسَكْتَ نَفْسِي فَارْحَمْهَا، وَإِنْ أَرْسَلْتَهَا فَاحْفَظْهَا بِمَا تَحْفَظُ بِهِ عِبَادَكَ الصَّالِحِينَ",
    "transliteration": "Bismika rabbi wada'tu janbi, wa bika arfa'uhu, in amsakta nafsi farhamha, wa in arsaltaha fahfazha bima tahfazu bihi 'ibadakas-salihin.",
    "meaning": "In Your name, my Lord, I lay my side down, and in Your name I rise. If You take my soul, have mercy on it, and if You return it, protect it as You protect Your righteous servants.",
    "reference": "Bukhari 11/126"
  }
]