[
  {
    "title": "Dua for Healing from All Diseases",
    "bangla": "Allahumma Rabban-nasi, adhhibil-ba'sa, washfi, antash-Shafi, la shifa'a illa shifa'uka, shifaan la yughadiru saqama.",
    "arabic": "اللَّهُمَّ رَبَّ النَّاسِ، أَذْهِبِ الْبَأْسَ، اشْفِ، أَنْتَ الشَّافِي، لَا شِفَاءَ إِلَّا شِفَاؤُكَ، شِفَاءً لَا يُغَادِرُ سَقَمًا",
    "transliteration": "Allahumma Rabban-nasi, adhhibil-ba'sa, washfi, antash-Shafi, la shifa'a illa shifa'uka, shifaan la yughadiru saqama.",
    "meaning": "O Allah, Lord of mankind, remove the hardship and grant healing, for You are the Healer. There is no healing except Your healing, a healing that leaves no illness.",
    "reference": "Bukhari 7/155"
  },
  {
    "title": "Dua for Protection from Serious Illness",
    "bangla": "Allahumma inni a'udhu bika minal-barasi, wal-jununi, wal-judhami, wa min sayy'il-asqam.",
    "arabic": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْبَرَصِ، وَالْجُنُونِ، وَالْجُذَامِ، وَمِنْ سَيِّئِ الْأَسْقَامِ",
    "transliteration": "Allahumma inni a'udhu bika minal-barasi, wal-jununi, wal-judhami, wa min sayy'il-asqam.",
    "meaning": "O Allah, I seek refuge with You from leprosy, insanity, elephantiasis, and from evil diseases.",
    "reference": "Abu Dawood 4/281"
  },
  {
    "title": "Dua from Quran for Healing",
    "bangla": "Wa idha maridtu fahuwa yashfini.",
    "arabic": "وَإِذَا مَرِضْتُ فَهُوَ يَشْفِينِ",
    "transliteration": "Wa idha maridtu fahuwa yashfini.",
    "meaning": "And when I am ill, it is He who cures me.",
    "reference": "Quran 26:80"
  },
  {
    "title": "Dua for Patient and Healing",
    "bangla": "Rabbana aatinaa fiddunya hasanatan wa fil aakhirati hasanatan wa qinaa azaaban naar.",
    "arabic": "رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الْآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ",
    "transliteration": "Rabbana aatinaa fiddunya hasanatan wa fil aakhirati hasanatan wa qinaa azaaban naar.",
    "meaning": "Our Lord, give us in this world good and in the Hereafter good and protect us from the punishment of the Fire.",
    "reference": "Quran 2:201"
  },
  {
    "title": "Ruqyah for Healing",
    "bangla": "Bismillahi arqika, min kulli shay'in yu'dhika, min sharri kulli nafsin aw 'aynin hasidin, Allahu yashfika, bismillahi arqika.",
    "arabic": "بِسْمِ اللَّهِ أَرْقِيكَ، مِنْ كُلِّ شَيْءٍ يُؤْذِيكَ، مِنْ شَرِّ كُلِّ نَفْسٍ أَوْ عَيْنِ حَاسِدٍ، اللَّهُ يَشْفِيكَ، بِسْمِ اللَّهِ أَرْقِيكَ",
    "transliteration": "Bismillahi arqika, min kulli shay'in yu'dhika, min sharri kulli nafsin aw 'aynin hasidin, Allahu yashfika, bismillahi arqika.",
    "meaning": "In the name of Allah I perform ruqyah for you, from everything that harms you, from the evil of every soul or envious eye, may Allah heal you, in the name of Allah I perform ruqyah for you.",
    "reference": "Muslim 4/1718"
  },
  {
    "title": "Dua for Relief from Pain",
    "bangla": "Allahumma rabbi-nnasi, mudhhibal-ba'si, ishfi anta ash-shafi, la shafia illa anta.",
    "arabic": "اللَّهُمَّ رَبَّ النَّاسِ، مُذْهِبَ الْبَأْسِ، اشْفِ أَنْتَ الشَّافِي، لَا شَافِيَ إِلَّا أَنْتَ",
    "transliteration": "Allahumma rabbi-nnasi, mudhhibal-ba'si, ishfi anta ash-shafi, la shafia illa anta.",
    "meaning": "O Allah, Lord of people, Remover of harm, cure, You are the Curer. There is no curer but You.",
    "reference": "Bukhari 7/152"
  },
  {
    "title": "Dua When Visiting Sick",
    "bangla": "La ba'sa, tahurun in sha' allah.",
    "arabic": "لَا بَأْسَ، طَهُورٌ إِنْ شَاءَ اللَّهُ",
    "transliteration": "La ba'sa, tahurun in sha' allah.",
    "meaning": "Do not worry, it is a purification (from sins) if Allah wills.",
    "reference": "Bukhari 7/157"
  },
  {
    "title": "Dua for Protection from Evil Eye",
    "bangla": "A'udhu bi kalimatillahit-tammati min kulli shaytanin wa hammatin wa min kulli 'aynin lammatin.",
    "arabic": "أَعُوذُ بِكَلِمَاتِ اللَّهِ التَّامَّاتِ مِنْ كُلِّ شَيْطَانٍ وَهَامَّةٍ، وَمِنْ كُلِّ عَيْنٍ لَامَّةٍ",
    "transliteration": "A'udhu bi kalimatillahit-tammati min kulli shaytanin wa hammatin wa min kulli 'aynin lammatin.",
    "meaning": "I seek refuge in the perfect words of Allah from every devil and poisonous pest, and from every evil eye.",
    "reference": "Bukhari 4/119"
  },
  {
    "title": "Dua for General Healing",
    "bangla": "Bismillah, turbatu ardina, biriqati ba'dina, yushfa bihi saqeemuna, bi-idhni rabbina.",
    "arabic": "بِسْمِ اللَّهِ، تُرْبَةُ أَرْضِنَا، بِرِيقَةِ بَعْضِنَا، يُشْفَىٰ بِهِ سَقِيمُنَا، بِإِذْنِ رَبِّنَا",
    "transliteration": "Bismillah, turbatu ardina, biriqati ba'dina, yushfa bihi saqeemuna, bi-idhni rabbina.",
    "meaning": "In the name of Allah, the dust of our land mixed with the saliva of one of us would cure our patient with the permission of our Lord.",
    "reference": "Bukhari 7/152"
  },
  {
    "title": "Dua from Quran for Mercy and Healing",
    "bangla": "Rabbana afrigh 'alayna sabran wa thabbit aqdamana wansurna 'alal-qawmil-kafirin.",
    "arabic": "رَبَّنَا أَفْرِغْ عَلَيْنَا صَبْرًا وَثَبِّتْ أَقْدَامَنَا وَانصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ",
    "transliteration": "Rabbana afrigh 'alayna sabran wa thabbit aqdamana wansurna 'alal-qawmil-kafirin.",
    "meaning": "Our Lord, pour upon us patience and plant firmly our feet and give us victory over the disbelieving people.",
    "reference": "Quran 2:250"
  }
]