[
  {
    "title": "রোজা রাখার নিয়ত (সাহরির সময়)",
    "bangla": "নাওয়াইতু আন আছুমা গাদাম মিন শাহরি রামাদানা হাযিহিস সানাতি লিল্লাহি তা'আলা।",
    "arabic": "نَوَيْتُ أَنْ أَصُومَ غَدًا مِنْ شَهْرِ رَمَضَانَ هَذِهِ السَّنَةِ لِلَّهِ تَعَالَى",
    "transliteration": "নাওয়াইতু আন আছুমা গাদাম মিন শাহরি রামাদানা হাযিহিস সানাতি লিল্লাহি তা'আলা।",
    "meaning": "আমি আগামীকাল রমজান মাসের এই বছরের রোজা আল্লাহ তাআলার জন্য রাখার নিয়ত করলাম।",
    "reference": "ফিকহুস সুন্নাহ, ইসলামিক ফাউন্ডেশন"
  },
  {
    "title": "সেহরির দোয়া",
    "bangla": "ওয়া বিসাওমিকা গাদাও নাওয়াইতু মিন শাহরি রামাদান।",
    "arabic": "وَبِصَوْمِ غَدٍ نَوَيْتُ مِنْ شَهْرِ رَمَضَانَ",
    "transliteration": "ওয়া বিসাওমিকা গাদাও নাওয়াইতু মিন শাহরি রামাদান।",
    "meaning": "আমি রমজান মাসের আগামীকালের রোজা রাখার নিয়ত করলাম।",
    "reference": "ফিকহুস সুন্নাহ, ইসলামিক ফাউন্ডেশন"
  },
  {
    "title": "ইফতারের দোয়া",
    "bangla": "আল্লাহুম্মা লাকা সুমতু, ওয়া আলা রিযকিকা আফতারতু।",
    "arabic": "اَللَّهُمَّ لَكَ صُمْتُ، وَعَلَى رِزْقِكَ أَفْطَرْتُ",
    "transliteration": "আল্লাহুম্মা লাকা সুমতু, ওয়া আলা রিযকিকা আফতারতু।",
    "meaning": "হে আল্লাহ! আমি তোমারই জন্য রোজা রেখেছি এবং তোমারই দেওয়া রিযিক দ্বারা ইফতার করছি।",
    "reference": "ইসলামিক ফাউন্ডেশন বাংলাদেশ - রোজা ও ইফতারের দোয়া"
  },
  {
    "title": "ইফতারের আগে দোয়া",
    "bangla": "আল্লাহুম্মা আ’ইন্নি ‘আলা জিকরিক, ওয়াশুকরিক, ওয়া হুসনি ইবাদাতিকা।",
    "arabic": "اللَّهُمَّ أَعِنِّي عَلَى ذِكْرِكَ وَشُكْرِكَ وَحُسْنِ عِبَادَتِكَ",
    "transliteration": "আল্লাহুম্মা আ’ইন্নি ‘আলা জিকরিক, ওয়াশুকরিক, ওয়া হুসনি ইবাদাতিকা।",
    "meaning": "হে আল্লাহ! আমাকে আপনার স্মরণ, কৃতজ্ঞতা এবং উত্তম ইবাদতের উপর সহায়তা করুন।",
    "reference": "আবু দাউদ: 1522"
  },
  {
    "title": "লাইলাতুল কদরের দোয়া",
    "bangla": "আল্লাহুম্মা ইন্নাকা আফুউওন তুহিব্বুল আফওয়া ফা’ফু আন্নী।",
    "arabic": "اللَّهُمَّ إِنَّكَ عَفُوٌّ تُحِبُّ الْعَفْوَ فَاعْفُ عَنِّي",
    "transliteration": "আল্লাহুম্মা ইন্নাকা আফুউওন তুহিব্বুল আফওয়া ফা’ফু আন্নী।",
    "meaning": "হে আল্লাহ! নিশ্চয়ই আপনি ক্ষমাশীল, ক্ষমা করতে ভালোবাসেন। অতএব, আমাকে ক্ষমা করুন।",
    "reference": "তিরমিজি: 3513"
  },
  {
    "title": "তারাবির দোয়া (দোয়া-কুনুত)",
    "bangla": "আল্লাহুম্মাহদিনি ফীমান হাদাইতা, ওয়া ‘আফিনি ফীমান ‘আফাইতা, ওয়া তাওয়াল্লানি ফীমান তাওাল্লাইতা, ওয়া বারিক লি ফীমা আ’তাইতা, ওয়াক্বিনি শাররা মা ক্বাদাইতা।",
    "arabic": "اللَّهُمَّ اهْدِنِي فِيمَنْ هَدَيْتَ، وَعَافِنِي فِيمَنْ عَافَيْتَ، وَتَوَلَّنِي فِيمَنْ تَوَلَّيْتَ، وَبَارِكْ لِي فِيمَا أَعْطَيْتَ، وَقِنِي شَرَّ مَا قَضَيْتَ",
    "transliteration": "আল্লাহুম্মাহদিনি ফীমান হাদাইতা, ওয়া ‘আফিনি ফীমান ‘আফাইতা, ওয়া তাওয়াল্লানি ফীমান তাওাল্লাইতা, ওয়া বারিক লি ফীমা আ’তাইতা, ওয়াক্বিনি শাররা মা ক্বাদাইতা।",
    "meaning": "হে আল্লাহ! যাদেরকে হেদায়াত দিয়েছেন তাদের অন্তর্ভুক্ত করুন, যাদেরকে সুস্থতা দিয়েছেন তাদের অন্তর্ভুক্ত করুন, যাদেরকে অভিভাবকত্ব দিয়েছেন তাদের অন্তর্ভুক্ত করুন, যা দিয়েছেন তাতে বরকত দিন এবং আপনার ফয়সালার মন্দ দিক থেকে আমাকে রক্ষা করুন।",
    "reference": "তিরমিজি: 464"
  },
  {
    "title": "তারাবির পর দোয়া",
    "bangla": "সুবহানা জিল মুলকি ওয়াল মালাকূতি, সুবহানা জিল ইজ্জাতি ওয়াল আযামাতি ওয়াল হাইবাতি ওয়াল কুদরাতি ওয়াল কিবরিয়াই ওয়াল জাবারূত।",
    "arabic": "سُبْحَانَ ذِي الْمُلْكِ وَالْمَلَكُوتِ، سُبْحَانَ ذِي الْعِزَّةِ وَالْعَظَمَةِ وَالْهَيْبَةِ وَالْقُدْرَةِ وَالْكِبْرِيَاءِ وَالْجَبَرُوتِ",
    "transliteration": "সুবহানা জিল মুলকি ওয়াল মালাকূতি, সুবহানা জিল ইজ্জাতি ওয়াল আযামাতি ওয়াল হাইবাতি ওয়াল কুদরাতি ওয়াল কিবরিয়াই ওয়াল জাবারূত।",
    "meaning": "মহিমা সেই সত্তার যিনি মালিক সমস্ত রাজত্ব ও জগতের। মহিমা সেই সত্তার যিনি ইজ্জত, মহিমা, মর্যাদা, ক্ষমতা, শ্রেষ্ঠত্ব ও প্রভুত্বের অধিকারী।",
    "reference": "দোয়া সংকলন (বাংলাদেশে প্রচলিত)"
  },
  {
    "title": "ইফতারের আগে মাগফিরাতের দোয়া",
    "bangla": "আল্লাহুম্মা গফিরলী যুনূবী, ওয়াসরিফ ‘আন্নী সাইয়িআতি, ওয়াওফিরলী আ’লা মারযাতিকা।",
    "arabic": "اللَّهُمَّ اغْفِرْ لِي ذُنُوبِي وَاصْرِفْ عَنِّي سَيِّئَاتِي وَاغْفِرْ لِي عَلَى مَرْضَاتِكَ",
    "transliteration": "আল্লাহুম্মা গফিরলী যুনূবী, ওয়াসরিফ ‘আন্নী সাইয়িআতি, ওয়াওফিরলী আ’লা মারযাতিকা।",
    "meaning": "হে আল্লাহ! আমার গুনাহসমূহ ক্ষমা করুন, আমার থেকে মন্দ কাজ দূর করে দিন এবং আপনার সন্তুষ্টির সাথে আমাকে ক্ষমা করুন।",
    "reference": "ফিকহী দোয়া"
  },
  {
    "title": "ইফতারের পর শোকরিয়া দোয়া",
    "bangla": "আলহামদু লিল্লাহিল্লাযী আ’আনানী ফা সোমতু, ওয়া রাযাক্বানী ফা আফতারতু।",
    "arabic": "الْحَمْدُ لِلَّهِ الَّذِي أَعَانَنِي فَصُمْتُ، وَرَزَقَنِي فَأَفْطَرْتُ",
    "transliteration": "আলহামদু লিল্লাহিল্লাযী আ’আনানী ফা সোমতু, ওয়া রাযাক্বানী ফা আফতারতু।",
    "meaning": "সমস্ত প্রশংসা আল্লাহর জন্য, যিনি আমাকে সহায়তা করেছেন রোজা রাখার জন্য এবং রিযিক দিয়েছেন ইফতার করার জন্য।",
    "reference": "ফিকহী দোয়া"
  },
  {
    "title": "সাহরির পর দোয়া",
    "bangla": "ইয়া হাইয়্যু ইয়া কাইয়্যূম, বিরাহমাতিকা আসতাগীস, আসলিহ লি শা'নী কুল্লাহ, ওয়ালা তাকিলনী ইলা নাফসী তারফাতা আ’ইন।",
    "arabic": "يَا حَيُّ يَا قَيُّومُ، بِرَحْمَتِكَ أَسْتَغِيثُ، أَصْلِحْ لِي شَأْنِي كُلَّهُ، وَلَا تَكِلْنِي إِلَى نَفْسِي طَرْفَةَ عَيْنٍ",
    "transliteration": "ইয়া হাইয়্যু ইয়া কাইয়্যূম, বিরাহমাতিকা আসতাগীস, আসলিহ লি শা'নী কুল্লাহ, ওয়ালা তাকিলনী ইলা নাফসী তারফাতা আ’ইন।",
    "meaning": "হে চিরঞ্জীব, হে সর্বপালনকর্তা! আমি আপনার রহমতের সাহায্য চাই। আমার সকল অবস্থা শোধরান, আর আমাকে আমার নিজের নফসের উপর এক চোখের পলকও ছেড়ে দেবেন না।",
    "reference": "আবু দাউদ: 5090"
  },
  {
    "title": "কদরের রাতে দোয়া (প্রচলিত)",
    "bangla": "আল্লাহুম্মাগফির লি, ওয়ালিদাইয়া, ওয়াল মুসলিমীনা ওয়াল মুসলিমাত।",
    "arabic": "اللَّهُمَّ اغْفِرْ لِي وَلِوَالِدَيَّ وَلِلْمُسْلِمِينَ وَالْمُسْلِمَاتِ",
    "transliteration": "আল্লাহুম্মাগফির লি, ওয়ালিদাইয়া, ওয়াল মুসলিমীনা ওয়াল মুসলিমাত।",
    "meaning": "হে আল্লাহ! আমাকে, আমার পিতা-মাতাকে, মুসলিম পুরুষ এবং মুসলিম নারীদেরকে ক্ষমা করুন।",
    "reference": "প্রচলিত দোয়া (বাংলাদেশে)"
  },
  {
    "title": "রমজানের রাতে দোয়া",
    "bangla": "আল্লাহুম্মা ইন্নী আসআলুকা রিযক্বান তায়্যিবান, ওয়াআমালান মুতাক্বাব্বালান, ওয়াআউযুবিকা মিন কালবিন লা ইয়াখশাআ, ওয়াদু’আ'ইন লা ইউসমা’উ।",
    "arabic": "اللَّهُمَّ إِنِّي أَسْأَلُكَ رِزْقًا طَيِّبًا، وَعَمَلًا مُتَقَبَّلًا، وَأَعُوذُ بِكَ مِنْ قَلْبٍ لَا يَخْشَعُ، وَدُعَاءٍ لَا يُسْمَعُ",
    "transliteration": "আল্লাহুম্মা ইন্নী আসআলুকা রিযক্বান তায়্যিবান, ওয়াআমালান মুতাক্বাব্বালান, ওয়াআউযুবিকা মিন কালবিন লা ইয়াখশাআ, ওয়াদু’আ'ইন লা ইউসমা’উ।",
    "meaning": "হে আল্লাহ! আমি আপনার নিকট পবিত্র রিযিক, কবুলযোগ্য আমল চাই এবং আমি আপনার কাছে আশ্রয় চাই এমন অন্তর থেকে যা ভীত নয়, এমন দোয়া থেকে যা কবুল হয় না।",
    "reference": "নববী দোয়া সংকলন"
  },
  {
    "title": "ঈদের নামাজ শেষে দোয়া",
    "bangla": "তাক্বাব্বালাল্লাহু মিন্না ওয়ামিংকুম।",
    "arabic": "تَقَبَّلَ اللَّهُ مِنَّا وَمِنْكُمْ",
    "transliteration": "তাক্বাব্বালাল্লাহু মিন্না ওয়ামিংকুম।",
    "meaning": "আল্লাহ আমাদের এবং তোমাদের পক্ষ থেকে কবুল করুন।",
    "reference": "ইবনে হাজম, আল-মুহাল্লা"
  },
  {
    "title": "রমজান শেষে দোয়া (বাংলাদেশে প্রচলিত)",
    "bangla": "আল্লাহুম্মা লা তুহরিমনা আজরাহু, ওয়ালা তা’ফিতনা বা’দাহু।",
    "arabic": "اللَّهُمَّ لَا تَحْرِمْنَا أَجْرَهُ وَلَا تُفْتِنَّا بَعْدَهُ",
    "transliteration": "আল্লাহুম্মা লা তুহরিমনা আজরাহু, ওয়ালা তা’ফিতনা বা’দাহু।",
    "meaning": "হে আল্লাহ! আমাদেরকে রমজানের সওয়াব থেকে বঞ্চিত করবেন না এবং রমজান চলে যাওয়ার পর আমাদেরকে বিপদে ফেলবেন না।",
    "reference": "মাসনূন দোয়া"
  },
  {
    "title": "রমজানের দোয়া",
    "bangla": "আল্লাহুম্মা সাল্লিমনী লিরামাদানা, ওয়াসাল্লিম রামাদানা লি, ওয়াতাসাল্লামহু মিন্নী মুতাক্বাব্বালা।",
    "arabic": "اللَّهُمَّ سَلِّمْنِي لِرَمَضَانَ، وَسَلِّمْ رَمَضَانَ لِي، وَتَسَلَّمْهُ مِنِّي مُتَقَبَّلًا",
    "transliteration": "আল্লাহুম্মা সাল্লিমনী লিরামাদানা, ওয়াসাল্লিম রামাদানা লি, ওয়াতাসাল্লামহু মিন্নী মুতাক্বাব্বালা।",
    "meaning": "হে আল্লাহ! আমাকে রমজান পর্যন্ত পৌঁছিয়ে দিন, রমজানকে আমার জন্য নিরাপদ করুন এবং আমার পক্ষ থেকে তা কবুল করুন।",
    "reference": "দোয়া সংকলন"
  },
  {
    "title": "শবে কদরে দীর্ঘ দোয়া",
    "bangla": "আল্লাহুম্মা ইন্নী আসআলুকা মিন খাইরি মা সা-আলাকা মিনহু নাবিয়্যুকা মুহাম্মাদুন সল্লাল্লাহু আলাইহি ওয়াসাল্লাম, ওয়াআউযুবিকা মিন শাররি মাস্তা’আযা মিনহু নাবিয়্যুকা মুহাম্মাদুন সল্লাল্লাহু আলাইহি ওয়াসাল্লাম।",
    "arabic": "اللَّهُمَّ إِنِّي أَسْأَلُكَ مِنْ خَيْرِ مَا سَأَلَكَ مِنْهُ نَبِيُّكَ مُحَمَّدٌ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَأَعُوذُ بِكَ مِنْ شَرِّ مَا اسْتَعَاذَ مِنْهُ نَبِيُّكَ مُحَمَّدٌ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ",
    "transliteration": "আল্লাহুম্মা ইন্নী আসআলুকা মিন খাইরি মা সা-আলাকা মিনহু নাবিয়্যুকা মুহাম্মাদুন সল্লাল্লাহু আলাইহি ওয়াসাল্লাম, ওয়াআউযুবিকা মিন শাররি মাস্তা’আযা মিনহু নাবিয়্যুকা মুহাম্মাদুন সল্লাল্লাহু আলাইহি ওয়াসাল্লাম।",
    "meaning": "হে আল্লাহ! আমি আপনার নিকট সেই সব ভালো জিনিস প্রার্থনা করছি যা আপনার নবী মুহাম্মাদ (সা.) আপনার নিকট প্রার্থনা করেছেন, এবং আমি আপনার কাছে আশ্রয় চাই সেই সব মন্দ জিনিস থেকে যেগুলো থেকে আপনার নবী মুহাম্মাদ (সা.) আশ্রয় চেয়েছেন।",
    "reference": "তিরমিজি: 3521"
  },
  {
    "title": "ইতিকাফের দোয়া",
    "bangla": "আল্লাহুম্মা ইন্নী নাওয়াইতুল ই’তিকাফা ফি হাজাল মাসজিদি মা দুমতু ফিহি।",
    "arabic": "اللَّهُمَّ إِنِّي نَوَيْتُ الْاعْتِكَافَ فِي هَذَا الْمَسْجِدِ مَا دُمْتُ فِيهِ",
    "transliteration": "আল্লাহুম্মা ইন্নী নাওয়াইতুল ই’তিকাফা ফি হাজাল মাসজিদি মা দুমতু ফিহি।",
    "meaning": "হে আল্লাহ! আমি যতক্ষণ এখানে থাকব ততক্ষণ এই মসজিদে ইতিকাফ করার নিয়ত করলাম।",
    "reference": "ফিকহী দোয়া"
  },
  {
    "title": "রমজান শেষে দোয়া",
    "bangla": "আল্লাহুম্মা তাক্বাব্বাল মিননা ইননাকা আন্তাস সামীউল আলীম।",
    "arabic": "اللَّهُمَّ تَقَبَّلْ مِنَّا إِنَّكَ أَنْتَ السَّمِيعُ الْعَلِيمُ",
    "transliteration": "আল্লাহুম্মা তাক্বাব্বাল মিননা ইননাকা আন্তাস সামীউল আলীম।",
    "meaning": "হে আল্লাহ! আমাদের (ইবাদাতসমূহ) কবুল করুন, নিশ্চয়ই আপনি সর্বশ্রোতা ও সর্বজ্ঞ।",
    "reference": "কুরআনিক দোয়া"
  }
]
