[
  {
    "title": "কালেমা তাইয়্যিবা",
    "text": "لَا إِلَٰهَ إِلَّا ٱللَّٰهُ مُحَمَّدٌ رَسُولُ ٱللَّٰهِ",
    "transliteration": "লা ইলাহা ইল্লাল্লাহু মুহাম্মাদুর রাসূলুল্লাহ।",
    "meaning": "আল্লাহ ছাড়া কোন ইলাহ (মাবুদ) নেই, মুহাম্মদ (সা.) আল্লাহর রাসূল।"
  },
  {
    "title": "কালেমা শাহাদাত",
    "text": "أَشْهَدُ أَنْ لَا إِلَٰهَ إِلَّا ٱللَّٰهُ وَأَشْهَدُ أَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ",
    "transliteration": "আশহাদু আল্লা ইলাহা ইল্লাল্লাহু ওয়া আশহাদু আন্না মুহাম্মাদান আবদুহু ওয়া রাসূলুহু।",
    "meaning": "আমি সাক্ষ্য দিচ্ছি যে, আল্লাহ ছাড়া কোন ইলাহ নেই এবং আমি সাক্ষ্য দিচ্ছি যে মুহাম্মদ (সা.) তাঁর বান্দা ও রাসূল।"
  },
  {
    "title": "কালেমা তামজীদ",
    "text": "سُبْحَانَ ٱللَّٰهِ وَٱلْحَمْدُ لِلَّٰهِ وَلَا إِلَٰهَ إِلَّا ٱللَّٰهُ وَٱللَّٰهُ أَكْبَرُ وَلَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِٱللَّٰهِ ٱلْعَلِيِّ ٱلْعَظِيمِ",
    "transliteration": "সুবহানাল্লাহি ওয়াল হামদু লিল্লাহি ওয়া লা ইলাহা ইল্লাল্লাহু ওয়াল্লাহু আকবারু ওয়া লা হাওলা ওয়া লা কুওয়্যাতা ইল্লা বিল্লাহিল আলিয়্যিল আজিম।",
    "meaning": "আল্লাহ পবিত্র ও মহান, সকল প্রশংসা আল্লাহর জন্য, আল্লাহ ছাড়া কোন ইলাহ নেই, আল্লাহ সর্বশ্রেষ্ঠ, এবং মহান ও সর্বোচ্চ আল্লাহ ছাড়া কোন ক্ষমতা ও শক্তি নেই।"
  },
  {
    "title": "কালেমা তাওহীদ",
    "text": "لَا إِلَٰهَ إِلَّا ٱللَّٰهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ ٱلْمُلْكُ وَلَهُ ٱلْحَمْدُ، يُحْيِي وَيُمِيتُ، وَهُوَ عَلَىٰ كُلِّ شَيْءٍ قَدِيرٌ",
    "transliteration": "লা ইলাহা ইল্লাল্লাহু ওয়াহদাহু লা শরীকা লাহু, লাহুল মূলকু ওয়া লাহুল হামদু, ইউহয়ী ওয়া ইউমীতু, ওয়া হুয়া আলা কুল্লি শাইয়িন কাদীর।",
    "meaning": "আল্লাহ ছাড়া কোন ইলাহ নেই, তিনি একক, তাঁর কোন শরীক নেই, রাজত্ব তাঁরই এবং প্রশংসা তাঁরই, তিনি জীবন দান করেন ও মৃত্যু দেন, এবং তিনি সকল কিছুর উপর ক্ষমতাবান।"
  },
  {
    "title": "কালেমা ইস্তিগফার",
    "text": "أَسْتَغْفِرُ ٱللَّٰهَ رَبِّي مِنْ كُلِّ ذَنْبٍ وَأَتُوبُ إِلَيْهِ",
    "transliteration": "আস্তাগফিরুল্লাহা রব্বি মিন কুল্লি জামবিন ওয়া আতুবু ইলাইহি।",
    "meaning": "আমি আমার রব আল্লাহর কাছে সকল গুনাহের জন্য ক্ষমা প্রার্থনা করছি এবং তাঁর দিকেই ফিরছি (তাওবা করছি)।"
  },
  {
    "title": "কালেমা রদ্দে কুফর",
    "text": "ٱللَّٰهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ أَنْ أُشْرِكَ بِكَ وَأَنَا أَعْلَمُ وَأَسْتَغْفِرُكَ لِمَا لَا أَعْلَمُ",
    "transliteration": "আল্লাহুম্মা ইন্নি আউযু বিকা মিন আন উশরিকা বিকা ওয়া আনা আ'লামু ওয়া আসতাগফিরুকা লিমা লা আ'লামু।",
    "meaning": "হে আল্লাহ! আমি আপনার কাছে আশ্রয় চাই যে, আমি জেনে-শুনে আপনার সাথে শরীক করবো এবং আমি আমার অজানা গুনাহের জন্য আপনার কাছে ক্ষমা প্রার্থনা করছি।"
  }
]