[
  {
    "title": "সকাল-সন্ধ্যার যিকির",
    "bangla": "আল্লাহুম্মা আত্তিনি খাইরাল ইয়াওমি ওয়া খাইরাল লাইলাহ।",
    "arabic": "اَللّٰهُمَّ أَعْطِنِيْ خَيْرَ الْيَوْمِ وَخَيْرَ اللَّيْلَةِ",
    "transliteration": "আল্লাহুম্মা আত্তিনি খাইরাল ইয়াওমি ওয়া খাইরাল লাইলাহ।",
    "meaning": "হে আল্লাহ! আমাকে আজকের দিন ও রাতের কল্যাণ দিন।",
    "reference": "তিরমিজি: 3391"
  },
  {
    "title": "সকাল-সন্ধ্যা কৃতজ্ঞতার দোয়া",
    "bangla": "আল্লাহুম্মা মা আসবাহা বি মিন নি‘মাতিন আও বিআহাদিম মিন খালকিকা, ফা মিনকা ওয়াহদাকা লা শারীকালাকা, ফালাকাল হামদু ওয়া লাকাশ শু্কর।",
    "arabic": "اَللّٰهُمَّ مَا أَصْبَحَ بِيْ مِنْ نِعْمَةٍ أَوْ بِأَحَدٍ مِنْ خَلْقِكَ فَمِنْكَ وَحْدَكَ لَا شَرِيْكَ لَكَ، فَلَكَ الْحَمْدُ وَلَكَ الشُّكْرُ",
    "transliteration": "আল্লাহুম্মা মা আসবাহা বি মিন নি‘মাতিন আও বিআহাদিম মিন খালকিকা, ফা মিনকা ওয়াহদাকা লা শারীকালাকা, ফালাকাল হামদু ওয়া লাকাশ শু্কর।",
    "meaning": "হে আল্লাহ! আমার কাছে যে নিয়ামত এসেছে বা তোমার কোনো সৃষ্টি থেকে এসেছে, সবই তোমার পক্ষ থেকে, তোমার কোনো শরীক নেই। তোমার জন্যই সকল প্রশংসা এবং কৃতজ্ঞতা।",
    "reference": "আবু দাউদ: 5073"
  },
  {
    "title": "আল্লাহর কাছে আশ্রয় চাওয়া",
    "bangla": "আল্লাহুম্মা ইন্নি আউযু বিকা মিনাল হাম্মি ওয়াল হুযনি, ওয়াল আজজি ওয়াল কাসালি, ওয়াল বুকলি ওয়াল জুবনি, ওয়া দালাইদ-দাইনি ওয়া গালাবাতির রিজাল।",
    "arabic": "اَللّٰهُمَّ إِنِّيْ أَعُوْذُبِكَ مِنَ الْهَمِّ وَالْحُزْنِ، وَالْعَجْزِ وَالْكَسَلِ، وَالْبُخْلِ وَالْجُبْنِ، وَضَلَعِ الدَّيْنِ وَغَلَبَةِ الرِّجَالِ",
    "transliteration": "আল্লাহুম্মা ইন্নি আউযু বিকা মিনাল হাম্মি ওয়াল হুযনি, ওয়াল আজজি ওয়াল কাসালি, ওয়াল বুকলি ওয়াল জুবনি, ওয়া দালাইদ-দাইনি ওয়া গালাবাতির রিজাল।",
    "meaning": "হে আল্লাহ! আমি আপনার কাছে আশ্রয় চাই দুশ্চিন্তা ও দুঃখ থেকে, অক্ষমতা ও আলস্য থেকে, কৃপণতা ও ভীরুতা থেকে, ঋণের বোঝা ও মানুষের দমন থেকে।",
    "reference": "বুখারি: 6369"
  },
  {
    "title": "সকাল-সন্ধ্যা হিফাজতের দোয়া",
    "bangla": "বিসমিল্লাহিল্লাযি লা ইয়াদুরু মাআসমিহি শাইউন ফিল আরদি ওয়ালা ফিসসামা’ই, ওয়া হুয়াস সামীউল আলীম।",
    "arabic": "بِسْمِ اللّٰهِ الَّذِيْ لَا يَضُرُّ مَعَ اسْمِهٖ شَيْءٌ فِي الْاَرْضِ وَلَا فِي السَّمَاءِ وَهُوَ السَّمِيْعُ الْعَلِيْمُ",
    "transliteration": "বিসমিল্লাহিল্লাযি লা ইয়াদুরু মাআসমিহি শাইউন ফিল আরদি ওয়ালা ফিসসামা’ই, ওয়া হুয়াস সামীউল আলীম।",
    "meaning": "আল্লাহর নামে (আমি আশ্রয় নিচ্ছি), যাঁর নামের বরকতে পৃথিবী ও আসমানে কোনো কিছু ক্ষতি করতে পারে না। আর তিনি সর্বশ্রোতা ও সর্বজ্ঞ।",
    "reference": "আবু দাউদ: 5088"
  },
  {
    "title": "সকাল-সন্ধ্যা ইস্তিগফার",
    "bangla": "আস্তাগফিরুল্লাহা রাব্বি মিন কুলি জানবিন, আযনাব্তুহু আমদান আও খাতআন সিররান আও আলানিয়াতান, ওয়া আতুবু ইলাইহি।",
    "arabic": "اَسْتَغْفِرُ اللّٰهَ رَبِّيْ مِنْ كُلِّ ذَنْبٍ اَذْنَبْتُهُ عَمْدًا أَوْ خَطَأً سِرًّا أَوْ عَلَانِيَةً وَأَتُوْبُ إِلَيْهِ",
    "transliteration": "আস্তাগফিরুল্লাহা রাব্বি মিন কুলি জানবিন, আযনাব্তুহু আমদান আও খাতআন সিররান আও আলানিয়াতান, ওয়া আতুবু ইলাইহি।",
    "meaning": "আমি আল্লাহর কাছে ক্ষমা চাই, যেকোনো গোনাহ থেকে, যা আমি ইচ্ছাকৃত বা ভুলবশত করেছি, গোপনে বা প্রকাশ্যে করেছি। আর আমি তাঁর কাছে তওবা করছি।",
    "reference": "তিরমিজি: 3393"
  },
  {
    "title": "রক্ষাকারী দোয়া",
    "bangla": "হাসবিয়াল্লাহু লা ইলাহা ইল্লা হুয়া, আলাইহি তাওয়াক্কালতু, ওয়া হুয়া রাব্বুল আরশিল আযীম।",
    "arabic": "حَسْبِيَ اللّٰهُ لَا إِلٰهَ إِلَّا هُوَ، عَلَيْهِ تَوَكَّلْتُ، وَهُوَ رَبُّ الْعَرْشِ الْعَظِيْمِ",
    "transliteration": "হাসবিয়াল্লাহু লা ইলাহা ইল্লা হুয়া, আলাইহি তাওয়াক্কালতু, ওয়া হুয়া রাব্বুল আরশিল আযীম।",
    "meaning": "আল্লাহই আমার জন্য যথেষ্ট, তিনি ছাড়া কোনো উপাস্য নেই। আমি তাঁর উপর ভরসা করেছি এবং তিনি মহাআরশের রব।",
    "reference": "আবু দাউদ: 5081"
  },
  {
    "title": "সকাল-সন্ধ্যা হেফাজতের দোয়া",
    "bangla": "আউযু বি কালিমাতিল্লাহিত তাম্মাতি মিন শাররি মা খালাক।",
    "arabic": "أَعُوْذُ بِكَلِمَاتِ اللّٰهِ التَّامَّاتِ مِنْ شَرِّ مَا خَلَقَ",
    "transliteration": "আউযু বি কালিমাতিল্লাহিত তাম্মাতি মিন শাররি মা খালাক।",
    "meaning": "আমি আল্লাহর পরিপূর্ণ বাণীর মাধ্যমে আশ্রয় নিচ্ছি, তিনি যা কিছু সৃষ্টি করেছেন তার অনিষ্ট থেকে।",
    "reference": "মুসলিম: 2708"
  },
  {
    "title": "সকাল-সন্ধ্যা আল্লাহর প্রশংসা",
    "bangla": "সুবহানাল্লাহি ওয়া বিহামদিহি ‘আদাদা খালকিহি, ওয়া রিদা নাফসিহি, ওয়া জিনাতা আরশিহি, ওয়া মিদাদা কালিমাতিহি।",
    "arabic": "سُبْحَانَ اللّٰهِ وَبِحَمْدِهِ عَدَدَ خَلْقِهٖ، وَرِضَا نَفْسِهٖ، وَزِنَةَ عَرْشِهٖ، وَمِدَادَ كَلِمَاتِهٖ",
    "transliteration": "সুবহানাল্লাহি ওয়া বিহামদিহি ‘আদাদা খালকিহি, ওয়া রিদা নাফসিহি, ওয়া জিনাতা আরশিহি, ওয়া মিদাদা কালিমাতিহি।",
    "meaning": "আমি আল্লাহর মহিমা ঘোষণা করছি এবং তাঁর প্রশংসা করছি তাঁর সৃষ্টির সংখ্যার সমান, তাঁর সন্তুষ্টির সমান, তাঁর আরশের ভারের সমান এবং তাঁর বাণীর কালির সমান।",
    "reference": "মুসলিম: 2726"
  },
  {
    "title": "সকাল-সন্ধ্যা আল্লাহর কাছে দোয়া",
    "bangla": "আল্লাহুম্মা ইন্নি আসআলুকা আফিয়াতান ফিদ্দুনিয়া ওয়াল আখিরাহ।",
    "arabic": "اَللّٰهُمَّ إِنِّيْ أَسْأَلُكَ عَافِيَةً فِي الدُّنْيَا وَالْآخِرَةِ",
    "transliteration": "আল্লাহুম্মা ইন্নি আসআলুকা আফিয়াতান ফিদ্দুনিয়া ওয়াল আখিরাহ।",
    "meaning": "হে আল্লাহ! আমি আপনার কাছে দুনিয়া ও আখিরাতের কল্যাণ ও নিরাপত্তা চাই।",
    "reference": "আবু দাউদ: 5074"
  },
  {
    "title": "সকাল-সন্ধ্যা মৃত্যুর আগ পর্যন্ত ঈমান",
    "bangla": "আল্লাহুম্মা আহইনি আলাল ইসলামী, ওয়া আমিতনি আলাল ইমান।",
    "arabic": "اَللّٰهُمَّ أَحْيِنِيْ عَلَى الْإِسْلَامِ وَأَمِتْنِيْ عَلَى الْإِيْمَانِ",
    "transliteration": "আল্লাহুম্মা আহইনি আলাল ইসলামী, ওয়া আমিতনি আলাল ইমান।",
    "meaning": "হে আল্লাহ! আমাকে ইসলামের উপর জীবিত রাখুন এবং ঈমানের উপর মৃত্যু দিন।",
    "reference": "মুসনাদ আহমদ: 11625"
  }
]
