  [
  {
    "title": "আযানের পরে দোয়া",
    "bangla": "আল্লাহুম্মা রব্বা হাাঝিহিদ্ দা‘ওয়াতিত্ তাম্মাহ, ওয়াস্ সালাতিল কায়িমাহ, আতি মুহাম্মাদানিল ওয়াসীলাতা ওয়াল ফাদীলাহ, ওয়াবআ‘স্ হু মাক্বামাম মাহমূদানিল্লাযী ওয়াআ‘দতাহু।",
    "arabic": "اللَّهُمَّ رَبَّ هَذِهِ الدَّعْوَةِ التَّامَّةِ وَالصَّلَاةِ الْقَائِمَةِ آتِ مُحَمَّدًا الْوَسِيلَةَ وَالْفَضِيلَةَ وَابْعَثْهُ مَقَامًا مَحْمُودًا الَّذِي وَعَدْتَهُ",
    "transliteration": "আল্লাহুম্মা রব্বা হাাঝিহিদ্ দা‘ওয়াতিত্ তাম্মাহ, ওয়াস্ সালাতিল কায়িমাহ, আতি মুহাম্মাদানিল ওয়াসীলাতা ওয়াল ফাদীলাহ, ওয়াবআ‘স্ হু মাক্বামাম মাহমূদানিল্লাযী ওয়াআ‘দতাহু।",
    "meaning": "হে আল্লাহ! এই পরিপূর্ণ আহ্বান ও প্রতিষ্ঠিত সালাতের রব্ব! আপনি মুহাম্মাদ (সা.)-কে ওয়াসিলা ও ফজিলত দান করুন এবং তাঁকে সেই প্রশংসিত স্থানে পুনরুত্থিত করুন যা আপনি প্রতিশ্রুতি দিয়েছেন।",
    "reference": "বুখারি: 614, মুসলিম: 384"
  },
  {
    "title": "অজুর দোয়া",
    "bangla": "বিসমিল্লাহ।",
    "arabic": "بِسْمِ اللهِ",
    "transliteration": "বিসমিল্লাহ।",
    "meaning": "আল্লাহর নামে (আমি অজু শুরু করছি)।",
    "reference": "আবু দাউদ: 101"
  },
  {
    "title": "ওজু শেষে দোয়া",
    "bangla": "আশহাদু আল্লা ইলাহা ইল্লাল্লাহু ওয়াহদাহু লা শারীকালাহু, ওয়া আশহাদু আন্না মুহাম্মাদান আবদুহু ওয়া রাসূলুহু।",
    "arabic": "أَشْهَدُ أَنْ لَا إِلٰهَ إِلَّا اللهُ وَحْدَهُ لَا شَرِيْكَ لَهُ، وَأَشْهَدُ أَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُوْلُهُ",
    "transliteration": "আশহাদু আল্লা ইলাহা ইল্লাল্লাহু ওয়াহদাহু লা শারীকালাহু, ওয়া আশহাদু আন্না মুহাম্মাদান আবদুহু ওয়া রাসূলুহু।",
    "meaning": "আমি সাক্ষ্য দিচ্ছি যে, আল্লাহ ছাড়া কোনো উপাস্য নেই, তিনি একক, তাঁর কোনো অংশীদার নেই। আর আমি সাক্ষ্য দিচ্ছি যে মুহাম্মাদ (সা.) তাঁর বান্দা ও রাসূল।",
    "reference": "মুসলিম: 234"
  },
  {
    "title": "সানা",
    "bangla": "সুবহানাকাল্লাহুম্মা ওয়া বিহামদিকা, ওয়া তাবারাকাসমুকা, ওয়া তা‘আলা জাদ্দুকা, ওয়ালা ইলাহা গাইরুকা।",
    "arabic": "سُبْحَانَكَ اللَّهُمَّ وَبِحَمْدِكَ، وَتَبَارَكَ اسْمُكَ، وَتَعَالَى جَدُّكَ، وَلَا إِلٰهَ غَيْرُكَ",
    "transliteration": "সুবহানাকাল্লাহুম্মা ওয়া বিহামদিকা, ওয়া তাবারাকাসমুকা, ওয়া তা‘আলা জাদ্দুকা, ওয়ালা ইলাহা গাইরুকা।",
    "meaning": "হে আল্লাহ! আপনি পবিত্র, আপনার প্রশংসা সহকারে। আপনার নাম কল্যাণময়, আপনার মাহাত্ম্য মহান, এবং আপনার ছাড়া আর কোনো উপাস্য নেই।",
    "reference": "আবু দাউদ: 776"
  },
  {
    "title": "রুকুতে দোয়া",
    "bangla": "সুবহানা রব্বিয়াল আজীম।",
    "arabic": "سُبْحَانَ رَبِّيَ الْعَظِيمِ",
    "transliteration": "সুবহানা রব্বিয়াল আজীম।",
    "meaning": "আমি আমার মহান রব্বকে পবিত্র ঘোষণা করছি।",
    "reference": "আবু দাউদ: 869"
  },
  {
    "title": "রুকু থেকে উঠায় দোয়া",
    "bangla": "সামিআল্লাহু লিমান হামিদাহ। রব্বানা লাকাল হামদ।",
    "arabic": "سَمِعَ اللهُ لِمَنْ حَمِدَهُ، رَبَّنَا لَكَ الْحَمْدُ",
    "transliteration": "সামিআল্লাহু লিমান হামিদাহ। রব্বানা লাকাল হামদ।",
    "meaning": "আল্লাহ তাঁর প্রশংসাকারীর কথা শুনেছেন। হে আমাদের রব্ব! সমস্ত প্রশংসা আপনারই জন্য।",
    "reference": "বুখারি: 796, মুসলিম: 392"
  },
  {
    "title": "সিজদার দোয়া",
    "bangla": "সুবহানা রব্বিয়াল আ‘লা।",
    "arabic": "سُبْحَانَ رَبِّيَ الأَعْلَى",
    "transliteration": "সুবহানা রব্বিয়াল আ‘লা।",
    "meaning": "আমি আমার সর্বোচ্চ রব্বকে পবিত্র ঘোষণা করছি।",
    "reference": "মুসলিম: 772"
  },
  {
    "title": "দুই সেজদার মাঝে দোয়া",
    "bangla": "রব্বিঘফিরলী, রব্বিঘফিরলী।",
    "arabic": "رَبِّ اغْفِرْ لِي، رَبِّ اغْفِرْ لِي",
    "transliteration": "রব্বিঘফিরলী, রব্বিঘফিরলী।",
    "meaning": "হে আমার রব্ব! আমাকে ক্ষমা করুন, হে আমার রব্ব! আমাকে ক্ষমা করুন।",
    "reference": "আবু দাউদ: 850"
  },
  {
    "title": "তাশাহহুদ",
    "bangla": "আত্তাহিয়্যাতু লিল্লাহি ওয়াছ ছাওয়াতু ওয়াত্ তইয়িবাতু, আসসালামু ‘আলাইকা আইয়ুহান নাবিয়্যু ওয়া রাহমাতুল্লাহি ওয়া বারাকাতুহু, আসসালামু ‘আলাইনা ওয়া ‘আলা ইবাদিল্লাহিস্ সালিহীন। আশহাদু আল্লা ইলাহা ইল্লাল্লাহু ওয়া আশহাদু আন্না মুহাম্মাদান আবদুহু ওয়া রাসূলুহু।",
    "arabic": "التَّحِيَّاتُ للهِ وَالصَّلَوَاتُ وَالطَّيِّبَاتُ، السَّلامُ عَلَيْكَ أَيُّهَا النَّبِيُّ وَرَحْمَةُ اللهِ وَبَرَكَاتُهُ، السَّلامُ عَلَيْنَا وَعَلَى عِبَادِ اللهِ الصَّالِحِينَ، أَشْهَدُ أَنْ لاَ إِلٰهَ إِلاَّ اللهُ، وَأَشْهَدُ أَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ",
    "transliteration": "আত্তাহিয়্যাতু লিল্লাহি ওয়াছ ছাওয়াতু ওয়াত্ তইয়িবাতু, আসসালামু ‘আলাইকা আইয়ুহান নাবিয়্যু ওয়া রাহমাতুল্লাহি ওয়া বারাকাতুহু, আসসালামু ‘আলাইনা ওয়া ‘আলা ইবাদিল্লাহিস্ সালিহীন। আশহাদু আল্লা ইলাহা ইল্লাল্লাহু ওয়া আশহাদু আন্না মুহাম্মাদান আবদুহু ওয়া রাসূলুহু।",
    "meaning": "সব প্রশংসা, সালাত ও পবিত্রতা আল্লাহর জন্য। হে নবী! আপনার প্রতি সালাম, আল্লাহর রহমত ও বরকত বর্ষিত হোক। আমাদের প্রতি এবং আল্লাহর সৎ বান্দাদের প্রতি সালাম বর্ষিত হোক। আমি সাক্ষ্য দিচ্ছি যে, আল্লাহ ছাড়া কোনো উপাস্য নেই এবং আমি সাক্ষ্য দিচ্ছি যে মুহাম্মাদ (সা.) তাঁর বান্দা ও রাসূল।",
    "reference": "বুখারি: 831, মুসলিম: 402"
  },
  {
    "title": "দরুদ শরীফ",
    "bangla": "আল্লাহুম্মা সাল্লি ‘আলা মুহাম্মাদিঁ ওয়া ‘আলা আালি মুহাম্মাদিন, কামা সাল্লাইতা ‘আলা ইবরাহীমা ওয়া ‘আলা আালি ইবরাহীমা, ইন্নাকা হামিদুম মাজীদ। আল্লাহুম্মা বারিক ‘আলা মুহাম্মাদিঁ ওয়া ‘আলা আালি মুহাম্মাদিন, কামা বারাকতা ‘আলা ইবরাহীমা ওয়া ‘আলা আালি ইবরাহীমা, ইন্নাকা হামিদুম মাজীদ।",
    "arabic": "اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ كَمَا صَلَّيْتَ عَلَى إِبْرَاهِيمَ وَعَلَى آلِ إِبْرَاهِيمَ إِنَّكَ حَمِيدٌ مَجِيدٌ، اللَّهُمَّ بَارِكْ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ كَمَا بَارَكْتَ عَلَى إِبْرَاهِيمَ وَعَلَى آلِ إِبْرَاهِيمَ إِنَّكَ حَمِيدٌ مَجِيدٌ",
    "transliteration": "আল্লাহুম্মা সাল্লি ‘আলা মুহাম্মাদিঁ ওয়া ‘আলা আালি মুহাম্মাদিন, কামা সাল্লাইতা ‘আলা ইবরাহীমা ওয়া ‘আলা আালি ইবরাহীমা, ইন্নাকা হামিদুম মাজীদ। আল্লাহুম্মা বারিক ‘আলা মুহাম্মাদিঁ ওয়া ‘আলা আালি মুহাম্মাদিন, কামা বারাকতা ‘আলা ইবরাহীমা ওয়া ‘আলা আালি ইবরাহীমা, ইন্নাকা হামিদুম মাজীদ।",
    "meaning": "হে আল্লাহ! মুহাম্মাদ (সা.) ও তাঁর পরিবার-পরিজনের উপর আপনার রহমত বর্ষণ করুন, যেমন আপনি ইবরাহীম (আ.) ও তাঁর পরিবার-পরিজনের উপর রহমত বর্ষণ করেছেন। নিশ্চয়ই আপনি প্রশংসনীয় ও মহিমান্বিত। হে আল্লাহ! মুহাম্মাদ (সা.) ও তাঁর পরিবার-পরিজনের উপর বরকত দিন, যেমন আপনি ইবরাহীম (আ.) ও তাঁর পরিবার-পরিজনের উপর বরকত দিয়েছেন। নিশ্চয়ই আপনি প্রশংসনীয় ও মহিমান্বিত।",
    "reference": "বুখারি: 6357, মুসলিম: 406"
  },
  {
    "title": "নামাজ শুরুর আগে দোয়া",
    "bangla": "আল্লাহুম্মা বা’ইদ বাইনী ওয়া বাইনা খাতায়ায়া, কামা বা’আদতা বাইনাাল মাশরিকি ওয়াল মাগরিব। আল্লাহুম্মা নাক্ব্বিনী মিন খাতায়ায়া কামা ইউনাক্কাছ্ সাওবুল আবিয়াদু মিনাদ্দানাস। আল্লাহুম্মাগসিল খাতায়ায়া বিল মা’ই, ওয়াস্ সালজি, ওয়াল বারাদ।",
    "arabic": "اللَّهُمَّ بَاعِدْ بَيْنِي وَبَيْنَ خَطَايَايَ كَمَا بَاعَدْتَ بَيْنَ الْمَشْرِقِ وَالْمَغْرِبِ، اللَّهُمَّ نَقِّنِي مِنْ خَطَايَايَ كَمَا يُنَقَّى الثَّوْبُ الْأَبْيَضُ مِنَ الدَّنَسِ، اللَّهُمَّ اغْسِلْ خَطَايَايَ بِالْمَاءِ وَالثَّلْجِ وَالْبَرَدِ",
    "transliteration": "আল্লাহুম্মা বা’ইদ বাইনী ওয়া বাইনা খাতায়ায়া, কামা বা’আদতা বাইনাাল মাশরিকি ওয়াল মাগরিব। আল্লাহুম্মা নাক্ব্বিনী মিন খাতায়ায়া কামা ইউনাক্কাছ্ সাওবুল আবিয়াদু মিনাদ্দানাস। আল্লাহুম্মাগসিল খাতায়ায়া বিল মা’ই, ওয়াস্ সালজি, ওয়াল বারাদ।",
    "meaning": "হে আল্লাহ! আমার পাপসমূহ আমার থেকে দূরে সরিয়ে দিন, যেমন আপনি পূর্ব ও পশ্চিমকে দূরে করেছেন। হে আল্লাহ! আমাকে আমার পাপ থেকে এমনভাবে পরিশুদ্ধ করুন যেমন সাদা কাপড় ময়লা থেকে পরিশুদ্ধ হয়। হে আল্লাহ! আমার পাপসমূহ ধুয়ে দিন পানি, তুষার ও শিলাবৃষ্টির মাধ্যমে।",
    "reference": "বুখারি: 744"
  },
  {
    "title": "দোয়া কুনূত",
    "bangla": "আল্লাহুম্মা ইন্না নাস্তাঈনুকা, ওয়া নাস্তাগফিরুকা, ওয়া নাস্তাহদীক, ওয়া নুমিনু বিকা, ওয়া নাতূবু ইলাইকা, ওয়া নাতাওয়াক্কালু ‘আলাইকা, ওয়া নুছনী ‘আলাইকাল খইর। ওয়ানাশকুরুকা ওয়ালা নাকফুরুকা, ওয়ানাখলাউ ওয়ানাত্রুকু মান ইয়াফজুরুক। আল্লাহুম্মা ইইয়্যাকা নাআবুদু, ওয়ালাকা নুসল্লী ওয়ানাসজুদু, ওয়াইলাইকা নাহ্ফিদু, নাৰজু রাহমাতাকা, ওয়ানাখশা ‘আযাবাকা, ইননা ‘আযাবাকা বিল কুফ্ফারি মুলহিক।",
    "arabic": "اللَّهُمَّ إِنَّا نَسْتَعِينُكَ وَنَسْتَغْفِرُكَ وَنَسْتَهْدِيكَ، وَنُؤْمِنُ بِكَ وَنَتُوبُ إِلَيْكَ، وَنَتَوَكَّلُ عَلَيْكَ وَنُثْنِي عَلَيْكَ الْخَيْرَ، وَنَشْكُرُكَ وَلَا نَكْفُرُكَ، وَنَخْلَعُ وَنَتْرُكُ مَنْ يَفْجُرُكَ. اللَّهُمَّ إِيَّاكَ نَعْبُدُ، وَلَكَ نُصَلِّي وَنَسْجُدُ، وَإِلَيْكَ نَسْعَى وَنَحْفِدُ، نَرْجُو رَحْمَتَكَ، وَنَخْشَى عَذَابَكَ، إِنَّ عَذَابَكَ بِالْكُفَّارِ مُلْحَقٌ",
    "transliteration": "আল্লাহুম্মা ইন্না নাস্তাঈনুকা, ওয়া নাস্তাগফিরুকা, ওয়া নাস্তাহদীক, ওয়া নুমিনু বিকা, ওয়া নাতূবু ইলাইকা, ওয়া নাতাওয়াক্কালু ‘আলাইকা, ওয়া নুছনী ‘আলাইকাল খইর। ওয়ানাশকুরুকা ওয়ালা নাকফুরুকা, ওয়ানাখলাউ ওয়ানাত্রুকু মান ইয়াফজুরুক। আল্লাহুম্মা ইইয়্যাকা নাআবুদু, ওয়ালাকা নুসল্লী ওয়ানাসজুদু, ওয়াইলাইকা নাহ্ফিদু, নাৰজু রাহমাতাকা, ওয়ানাখশা ‘আযাবাকা, ইননা ‘আযাবাকা বিল কুফ্ফারি মুলহিক।",
    "meaning": "হে আল্লাহ! আমরা আপনার সাহায্য চাই, আপনার কাছে ক্ষমা চাই, আপনার নিকট হিদায়াত চাই। আমরা আপনার প্রতি ঈমান রাখি এবং আপনার দিকে ফিরে আসি। আমরা আপনার উপর ভরসা করি এবং আপনার প্রশংসা করি। আমরা আপনাকে ধন্যবাদ দিই, অকৃতজ্ঞ হই না। আমরা তাদের থেকে বিরত হই যারা আপনার অবাধ্যতা করে। হে আল্লাহ! কেবল আপনাকেই আমরা ইবাদত করি, আপনার জন্যই নামাজ পড়ি, সিজদা করি, আপনার দিকে দৌড়াই। আমরা আপনার রহমত আশা করি এবং আপনার আযাব থেকে ভীত হই। নিশ্চয়ই আপনার আযাব কাফেরদের জন্য নির্ধারিত।",
    "reference": "আবু দাউদ: 1425"
  },
  {
    "title": "দুই সিজদার মাঝে দীর্ঘ দোয়া",
    "bangla": "আল্লাহুম্মাগফিরলী, ওয়ারহামনী, ওয়াজবুরনী, ওয়া রফা’নী, ওয়া হদিনী, ওয়াআফিনী, ওয়ারযুকনী।",
    "arabic": "اللَّهُمَّ اغْفِرْ لِي وَارْحَمْنِي وَاجْبُرْنِي وَارْفَعْنِي وَاهْدِنِي وَعَافِنِي وَارْزُقْنِي",
    "transliteration": "আল্লাহুম্মাগফিরলী, ওয়ারহামনী, ওয়াজবুরনী, ওয়া রফা’নী, ওয়া হদিনী, ওয়াআফিনী, ওয়ারযুকনী।",
    "meaning": "হে আল্লাহ! আমাকে ক্ষমা করুন, আমার প্রতি দয়া করুন, আমাকে পূর্ণতা দান করুন, আমাকে উচ্চ মর্যাদা দিন, আমাকে হিদায়াত দিন, আমাকে সুস্থতা দিন এবং আমাকে রিযিক দিন।",
    "reference": "আবু দাউদ: 850"
  },
  {
    "title": "তাসবীহে ফাতিমা",
    "bangla": "সুবহানাল্লাহ ৩৩ বার, আলহামদুলিল্লাহ ৩৩ বার, আল্লাহু আকবার ৩৪ বার।",
    "arabic": "سُبْحَانَ اللَّهِ ٣٣، الْحَمْدُ لِلَّهِ ٣٣، اللَّهُ أَكْبَرُ ٣٤",
    "transliteration": "সুবহানাল্লাহ ৩৩ বার, আলহামদুলিল্লাহ ৩৩ বার, আল্লাহু আকবার ৩৪ বার।",
    "meaning": "আল্লাহ পবিত্র, আল্লাহর জন্য সব প্রশংসা, আল্লাহ সর্বশ্রেষ্ঠ। (নিদ্রার আগে এভাবে পাঠ করা উত্তম)।",
    "reference": "বুখারি: 6318, মুসলিম: 2727"
  },
  {
    "title": "সালামের পরে দোয়া",
    "bangla": "আল্লাহুম্মা আ’ইন্নী ‘আলা জিকরিক, ওয়া শুকরিক, ওয়া হুসনি ইবাদাতিকা।",
    "arabic": "اللَّهُمَّ أَعِنِّي عَلَى ذِكْرِكَ وَشُكْرِكَ وَحُسْنِ عِبَادَتِكَ",
    "transliteration": "আল্লাহুম্মা আ’ইন্নী ‘আলা জিকরিক, ওয়া শুকরিক, ওয়া হুসনি ইবাদাতিকা।",
    "meaning": "হে আল্লাহ! আমাকে আপনার স্মরণ, আপনার শুকরিয়া আদায় এবং উত্তম ইবাদত করতে সাহায্য করুন।",
    "reference": "আবু দাউদ: 1522"
  },
  {
    "title": "নামাজ শেষে আয়াতুল কুরসি",
    "bangla": "আল্লাহু লা ইলাহা ইল্লা হুয়াল হাইয়্যুল ক্বাইয়্যুম... (সম্পূর্ণ আয়াতুল কুরসি)",
    "arabic": "اللَّهُ لَا إِلَٰهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ... (البقرة: 255)",
    "transliteration": "আল্লাহু লা ইলাহা ইল্লা হুয়াল হাইয়্যুল ক্বাইয়্যুম... (আয়াতুল কুরসি পূর্ণ পাঠ)।",
    "meaning": "আল্লাহ ছাড়া কোনো ইলাহ নেই, তিনি চিরঞ্জীব, সর্বদা সবকিছুর ধারক ও নিয়ামক... (পূর্ণ অর্থ সূরা বাকারা ২:২৫৫)।",
    "reference": "বুখারি: 2311"
  },
  {
    "title": "তিন কুল পড়া",
    "bangla": "সূরা ইখলাস, সূরা ফালাক, সূরা নাস প্রতিটি একবার করে।",
    "arabic": "قُلْ هُوَ اللَّهُ أَحَدٌ ... قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ ... قُلْ أَعُوذُ بِرَبِّ النَّاسِ",
    "transliteration": "কুল হুয়াল্লাহু আহাদ... কুল আউযু বিরাব্বিল ফালাক... কুল আউযু বিরাব্বিন নাস।",
    "meaning": "সূরা ইখলাস, সূরা ফালাক ও সূরা নাস পড়ে আত্মরক্ষা ও বরকতের জন্য দোয়া করা।",
    "reference": "আবু দাউদ: 1523"
  },
  {
    "title": "রুকু-সিজদায় দীর্ঘ দোয়া",
    "bangla": "সুবূহুন কুদ্দূসুন রব্বুল মালাইকাতি ওয়াররূহ।",
    "arabic": "سُبُّوحٌ قُدُّوسٌ رَبُّ الْمَلَائِكَةِ وَالرُّوحِ",
    "transliteration": "সুবূহুন কুদ্দূসুন রব্বুল মালাইকাতি ওয়াররূহ।",
    "meaning": "পরম পবিত্র, অতি পবিত্র, ফেরেশতা ও রূহের রব্ব।",
    "reference": "মুসলিম: 487"
  },
  {
    "title": "তাহাজ্জুদে দোয়া",
    "bangla": "আল্লাহুম্মা লাকাল হামদু, আন্তা কাইয়্যিমুস সামাওয়াতি ওয়াল আরদি ওয়া মান ফীহিন্না... (সম্পূর্ণ দোয়া দীর্ঘ)।",
    "arabic": "اللَّهُمَّ لَكَ الْحَمْدُ أَنْتَ قَيِّمُ السَّمَاوَاتِ وَالْأَرْضِ وَمَنْ فِيهِنَّ ...",
    "transliteration": "আল্লাহুম্মা লাকাল হামদু, আন্তা কাইয়্যিমুস সামাওয়াতি ওয়াল আরদি ওয়া মান ফীহিন্না... ",
    "meaning": "হে আল্লাহ! সমস্ত প্রশংসা আপনার জন্য। আপনি আসমান ও জমিন ও এর মধ্যে যা কিছু আছে সবকিছুর প্রতিপালক। (তাহাজ্জুদের দীর্ঘ দোয়া)।",
    "reference": "বুখারি: 1120, মুসলিম: 769"
  }
]
